spec/cassettes/hook_invoice_payment_succeeded.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '129'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:42 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1400'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_aU3BUZnbdOaOHVZH
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1418659842,
          "id": "cus_5KgoBQIOhw1YP0",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_5KgoBQIOhw1YP0/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5KgoBQIOhw1YP0/cards",
            "data": [
              {
                "id": "card_15A1Qk2nHroS7mLXkw7WANWV",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5KgoBQIOhw1YP0",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_15A1Qk2nHroS7mLXkw7WANWV"
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_5KgoBQIOhw1YP0&amount=100&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '51'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:44 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '328'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_G43f3rTg6hmVTQ6C
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_15A1Ql2nHroS7mLXzafCxcdp",
          "date": 1418659843,
          "amount": 100,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_5KgoBQIOhw1YP0",
          "description": null,
          "metadata": {},
          "invoice": null,
          "subscription": null,
          "quantity": null,
          "plan": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:44 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices
    body:
      encoding: US-ASCII
      string: customer=cus_5KgoBQIOhw1YP0
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '27'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:45 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1321'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_EQCjiILS3i2AjUcq
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1418659844,
          "id": "in_15A1Qm2nHroS7mLXAPam5Njq",
          "period_start": 1418659844,
          "period_end": 1418659844,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_15A1Qm2nHroS7mLXAPam5Njq/lines",
            "data": [
              {
                "id": "ii_15A1Ql2nHroS7mLXzafCxcdp",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1418659843,
                  "end": 1418659843
                },
                "subscription": null,
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_5KgoBQIOhw1YP0",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1418663444,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:45 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices/in_15A1Qm2nHroS7mLXAPam5Njq/pay
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:46 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1334'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_kWgxj3DH0I8xGwLE
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1418659844,
          "id": "in_15A1Qm2nHroS7mLXAPam5Njq",
          "period_start": 1418659844,
          "period_end": 1418659844,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_15A1Qm2nHroS7mLXAPam5Njq/lines",
            "data": [
              {
                "id": "ii_15A1Ql2nHroS7mLXzafCxcdp",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1418659843,
                  "end": 1418659843
                },
                "subscription": null,
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_5KgoBQIOhw1YP0",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 1,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": null,
          "charge": "ch_15A1Qo2nHroS7mLXmPTjwk8T",
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:46 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_15A1Qm2nHroS7mLXAPam5Njq
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:47 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1334'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_2fJwAXa0D7VvFfTv
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1418659844,
          "id": "in_15A1Qm2nHroS7mLXAPam5Njq",
          "period_start": 1418659844,
          "period_end": 1418659844,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_15A1Qm2nHroS7mLXAPam5Njq/lines",
            "data": [
              {
                "id": "ii_15A1Ql2nHroS7mLXzafCxcdp",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1418659843,
                  "end": 1418659843
                },
                "subscription": null,
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_5KgoBQIOhw1YP0",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 1,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": null,
          "charge": "ch_15A1Qo2nHroS7mLXmPTjwk8T",
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_15A1Qo2nHroS7mLXmPTjwk8T
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:10:48 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1225'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_eLmCNxfiUwMKBz60
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A1Qo2nHroS7mLXmPTjwk8T",
          "object": "charge",
          "created": 1418659846,
          "livemode": false,
          "paid": true,
          "amount": 100,
          "currency": "usd",
          "refunded": false,
          "captured": true,
          "card": {
            "id": "card_15A1Qk2nHroS7mLXkw7WANWV",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2030,
            "fingerprint": "0K7oMWAQAFG7TEob",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": "cus_5KgoBQIOhw1YP0",
            "type": "Visa"
          },
          "balance_transaction": "txn_15A1Qo2nHroS7mLXuSCk3vWx",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_5KgoBQIOhw1YP0",
          "invoice": "in_15A1Qm2nHroS7mLXAPam5Njq",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": []
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:10:48 GMT
recorded_with: VCR 2.9.2
