spec/cassettes/hook_charge_refunded.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '129'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:13 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1400'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_BzHgW7cZwpzpVkpe
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1418659633,
          "id": "cus_5Kgk0SgjVlQGAG",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_5Kgk0SgjVlQGAG/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5Kgk0SgjVlQGAG/cards",
            "data": [
              {
                "id": "card_15A1NN2nHroS7mLXqREoqYAR",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5Kgk0SgjVlQGAG",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_15A1NN2nHroS7mLXqREoqYAR"
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:13 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/test
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:14 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '273'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_75QdgrdgAIyVkA72
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "interval": "month",
          "name": "Test Plan",
          "created": 1406556583,
          "amount": 1499,
          "currency": "usd",
          "id": "test",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": null,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:14 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_5Kgk0SgjVlQGAG/subscriptions
    body:
      encoding: US-ASCII
      string: plan=test
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '9'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:16 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '736'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_aDd2gUuie87lSk0I
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_5KgkOF1NnECzuE",
          "plan": {
            "interval": "month",
            "name": "Test Plan",
            "created": 1406556583,
            "amount": 1499,
            "currency": "usd",
            "id": "test",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {},
            "statement_description": null
          },
          "object": "subscription",
          "start": 1418659634,
          "status": "active",
          "customer": "cus_5Kgk0SgjVlQGAG",
          "cancel_at_period_end": false,
          "current_period_start": 1418659634,
          "current_period_end": 1421338034,
          "ended_at": null,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:16 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_5Kgk0SgjVlQGAG
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:17 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2095'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_UokE0M50MOQwxkDx
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1418659634,
              "id": "in_15A1NO2nHroS7mLXwRAdsrgu",
              "period_start": 1418659634,
              "period_end": 1418659634,
              "lines": {
                "object": "list",
                "total_count": 1,
                "has_more": false,
                "url": "/v1/invoices/in_15A1NO2nHroS7mLXwRAdsrgu/lines",
                "data": [
                  {
                    "id": "sub_5KgkOF1NnECzuE",
                    "object": "line_item",
                    "type": "subscription",
                    "livemode": false,
                    "amount": 1499,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1418659634,
                      "end": 1421338034
                    },
                    "subscription": null,
                    "quantity": 1,
                    "plan": {
                      "interval": "month",
                      "name": "Test Plan",
                      "created": 1406556583,
                      "amount": 1499,
                      "currency": "usd",
                      "id": "test",
                      "object": "plan",
                      "livemode": false,
                      "interval_count": 1,
                      "trial_period_days": null,
                      "metadata": {},
                      "statement_description": null
                    },
                    "description": null,
                    "metadata": {}
                  }
                ],
                "count": 1
              },
              "subtotal": 1499,
              "total": 1499,
              "customer": "cus_5Kgk0SgjVlQGAG",
              "object": "invoice",
              "attempted": true,
              "closed": true,
              "forgiven": false,
              "paid": true,
              "livemode": false,
              "attempt_count": 1,
              "amount_due": 1499,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": 0,
              "next_payment_attempt": null,
              "webhooks_delivered_at": null,
              "charge": "ch_15A1NP2nHroS7mLXrwYzYi3j",
              "discount": null,
              "application_fee": null,
              "subscription": "sub_5KgkOF1NnECzuE",
              "metadata": {},
              "statement_description": null,
              "description": null,
              "receipt_number": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:17 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_15A1NP2nHroS7mLXrwYzYi3j
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:18 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1226'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Wh5U04b2hD7YW6JO
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A1NP2nHroS7mLXrwYzYi3j",
          "object": "charge",
          "created": 1418659635,
          "livemode": false,
          "paid": true,
          "amount": 1499,
          "currency": "usd",
          "refunded": false,
          "captured": true,
          "card": {
            "id": "card_15A1NN2nHroS7mLXqREoqYAR",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2030,
            "fingerprint": "0K7oMWAQAFG7TEob",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": "cus_5Kgk0SgjVlQGAG",
            "type": "Visa"
          },
          "balance_transaction": "txn_15A1NP2nHroS7mLXeaHOupDu",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_5Kgk0SgjVlQGAG",
          "invoice": "in_15A1NO2nHroS7mLXwRAdsrgu",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": []
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:18 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_15A1NO2nHroS7mLXwRAdsrgu
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:19 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1715'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_2hxDx3KAohg9Q6WD
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1418659634,
          "id": "in_15A1NO2nHroS7mLXwRAdsrgu",
          "period_start": 1418659634,
          "period_end": 1418659634,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_15A1NO2nHroS7mLXwRAdsrgu/lines",
            "data": [
              {
                "id": "sub_5KgkOF1NnECzuE",
                "object": "line_item",
                "type": "subscription",
                "livemode": false,
                "amount": 1499,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1418659634,
                  "end": 1421338034
                },
                "subscription": null,
                "quantity": 1,
                "plan": {
                  "interval": "month",
                  "name": "Test Plan",
                  "created": 1406556583,
                  "amount": 1499,
                  "currency": "usd",
                  "id": "test",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 1499,
          "total": 1499,
          "customer": "cus_5Kgk0SgjVlQGAG",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 1,
          "amount_due": 1499,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": null,
          "charge": "ch_15A1NP2nHroS7mLXrwYzYi3j",
          "discount": null,
          "application_fee": null,
          "subscription": "sub_5KgkOF1NnECzuE",
          "metadata": {},
          "statement_description": null,
          "description": null,
          "receipt_number": null
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:19 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_15A1NP2nHroS7mLXrwYzYi3j
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:20 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1226'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_MXfRfHxAFDXLOGMS
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A1NP2nHroS7mLXrwYzYi3j",
          "object": "charge",
          "created": 1418659635,
          "livemode": false,
          "paid": true,
          "amount": 1499,
          "currency": "usd",
          "refunded": false,
          "captured": true,
          "card": {
            "id": "card_15A1NN2nHroS7mLXqREoqYAR",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2030,
            "fingerprint": "0K7oMWAQAFG7TEob",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": "cus_5Kgk0SgjVlQGAG",
            "type": "Visa"
          },
          "balance_transaction": "txn_15A1NP2nHroS7mLXeaHOupDu",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_5Kgk0SgjVlQGAG",
          "invoice": "in_15A1NO2nHroS7mLXwRAdsrgu",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": []
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:20 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_15A1NP2nHroS7mLXrwYzYi3j/refund
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:21 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1569'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_MgnSjq0ftDIpwe2u
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A1NP2nHroS7mLXrwYzYi3j",
          "object": "charge",
          "created": 1418659635,
          "livemode": false,
          "paid": true,
          "amount": 1499,
          "currency": "usd",
          "refunded": true,
          "captured": true,
          "card": {
            "id": "card_15A1NN2nHroS7mLXqREoqYAR",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2030,
            "fingerprint": "0K7oMWAQAFG7TEob",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": "cus_5Kgk0SgjVlQGAG",
            "type": "Visa"
          },
          "balance_transaction": "txn_15A1NP2nHroS7mLXeaHOupDu",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 1499,
          "customer": "cus_5Kgk0SgjVlQGAG",
          "invoice": "in_15A1NO2nHroS7mLXwRAdsrgu",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": [
            {
              "id": "re_15A1NV2nHroS7mLXoIkW8HaO",
              "amount": 1499,
              "currency": "usd",
              "created": 1418659641,
              "object": "refund",
              "balance_transaction": "txn_15A1NV2nHroS7mLXJqp1nZ5a",
              "metadata": {},
              "charge": "ch_15A1NP2nHroS7mLXrwYzYi3j",
              "receipt_number": null,
              "reason": null
            }
          ]
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:21 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_15A1NP2nHroS7mLXrwYzYi3j
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Dec 2014 16:07:22 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1569'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_zoh5r4aSlGgfgs3O
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_15A1NP2nHroS7mLXrwYzYi3j",
          "object": "charge",
          "created": 1418659635,
          "livemode": false,
          "paid": true,
          "amount": 1499,
          "currency": "usd",
          "refunded": true,
          "captured": true,
          "card": {
            "id": "card_15A1NN2nHroS7mLXqREoqYAR",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 12,
            "exp_year": 2030,
            "fingerprint": "0K7oMWAQAFG7TEob",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "dynamic_last4": null,
            "customer": "cus_5Kgk0SgjVlQGAG",
            "type": "Visa"
          },
          "balance_transaction": "txn_15A1NP2nHroS7mLXeaHOupDu",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 1499,
          "customer": "cus_5Kgk0SgjVlQGAG",
          "invoice": "in_15A1NO2nHroS7mLXwRAdsrgu",
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "refunds": [
            {
              "id": "re_15A1NV2nHroS7mLXoIkW8HaO",
              "amount": 1499,
              "currency": "usd",
              "created": 1418659641,
              "object": "refund",
              "balance_transaction": "txn_15A1NV2nHroS7mLXJqp1nZ5a",
              "metadata": {},
              "charge": "ch_15A1NP2nHroS7mLXrwYzYi3j",
              "receipt_number": null,
              "reason": null
            }
          ]
        }
    http_version: 
  recorded_at: Mon, 15 Dec 2014 16:07:22 GMT
recorded_with: VCR 2.9.2
